{
  "name": "Crafting a Compelling Main Character",
  "description": "A blueprint for designing an unforgettable video game protagonist, exported on 10/1/2025",
  "nodes": [
    {
      "id": 1,
      "data": {
        "content": "# ⭐ Core Concept & Archetype\n\nThis is the foundation of your character. Before any details, you need a strong, central idea. This concept will guide every other decision you make.\n\n*\"A character is defined by the choices they make when the chips are down.\"*\n\n-----\n\n### 1\\. The High-Concept Pitch\n\nDescribe your character in a single, compelling sentence. This is your north star.\n\n  - *Examples:*\n  - \"A grizzled old warrior forced to become a father to a mystical child.\" (Kratos, God of War)\n  - \"A charming but reckless treasure hunter convinced he's the descendant of a legendary explorer.\" (Nathan Drake, Uncharted)\n  - \"An artificial being designed for war who develops a conscience and seeks a new purpose.\"\n\n### 2\\. Choose a Core Archetype\n\nArchetypes are universal patterns that give players a familiar starting point. You can blend or subvert them later, but start with a solid base.\n\n  - **The Hero:** Driven by a quest to overcome adversity.\n  - **The Rebel/Anti-Hero:** Fights against the status quo, often with morally gray methods.\n  - **The Sage/Mentor:** A wise guide, often burdened by past knowledge or failures.\n  - **The Trickster:** A chaotic agent of change who challenges norms through wit and mischief.\n  - **The Explorer:** Driven by a need to discover the unknown and push boundaries.\n\n### 3\\. Define the Central Theme\n\nWhat is the central question or conflict your character represents?\n\n- Redemption vs. Vengeance\n- Fate vs. Free Will\n- Humanity vs. Technology\n- Order vs. Chaos"
      },
      "position": {
        "x": 5000,
        "y": 4000
      },
      "title": "The Foundation"
    },
    {
      "id": 2,
      "data": {
        "content": "# 📜 Backstory & Motivation\n\nThis is the character's \"why.\" Their past shapes their present, and their motivation drives the entire narrative forward. A compelling backstory creates a stronger bond with the player.\n\n*Every scar tells a story.*\n\n----\n\n### 1\\. The Defining Moment\n\nWhat single event in their past set them on their current path? This is often a moment of trauma, triumph, or profound loss.\n\n  - *Example:* A failed mission that cost the lives of their squad; the day they discovered their unique powers; a betrayal by a trusted mentor.\n\n### 2\\. The Want vs. The Need\n\nThis is a critical concept in storytelling. A character's want is their external goal, while their need is their internal, subconscious requirement for growth.\n\n  - **Want (The Goal):** What the character *thinks* will solve their problems. It's usually concrete and plot-related. (e.g., \"I want to find the magical sword to defeat the villain.\")\n  - **Need (The Flaw):** What the character *actually* requires to be whole. This is the root of their character arc. (e.g., \"I need to learn to trust others to overcome my fear of abandonment.\")\n\nThe most compelling stories happen when the character must abandon their *want* to finally achieve their *need*.\n\n### 3\\. World Context\n\nHow did the world they grew up in shape them? Were they an outcast, a privileged noble, a street urchin? This context should justify their skills, biases, and worldview."
      },
      "position": {
        "x": 4350,
        "y": 3650
      },
      "title": "The \"Why\""
    },
    {
      "id": 3,
      "data": {
        "content": "# 🎭 Personality & Flaws\n\nGreat characters are not perfect; their flaws and contradictions make them relatable and three-dimensional. This is what defines who they are under pressure.\n\n*Perfection is boring. Flaws create conflict.*\n\n----\n\n### 1\\. Core Personality Traits\n\nChoose 3-5 key adjectives that describe their personality. Are they cynical, optimistic, pragmatic, reckless, compassionate?\n\n  - A good technique is to give them one trait that contradicts the others. (e.g., A brave warrior who is terrified of intimacy).\n\n### 2\\. The Central Flaw\n\nA character's primary flaw is the main obstacle to their growth and happiness. It should be something they must confront during their journey.\n\n  - **Arrogance:** Their overconfidence leads them to underestimate threats.\n  - **Fear:** They run from challenges or refuse the \"call to adventure.\"\n  - **Selfishness:** They prioritize their own goals at the expense of others.\n  - **Naivety:** They trust too easily, making them vulnerable to betrayal.\n\n### 3\\. Quirks and Habits\n\nWhat small, memorable details bring the character to life?\n\n  - A specific verbal tic or catchphrase.\n  - A nervous habit (e.g., flipping a coin).\n  - Their favorite food or drink.\n  - How they act when they are alone.\n\nThese details make a character feel less like a construct and more like a person."
      },
      "position": {
        "x": 5650,
        "y": 3650
      },
      "title": "The \"Who\""
    },
    {
      "id": 4,
      "data": {
        "content": "# 🎨 Visual Design & Aesthetics\n\nThe character's appearance should be a visual representation of their personality, history, and abilities. A strong silhouette should make them instantly recognizable.\n\n*Design is storytelling without words.*\n\n----\n\n### 1\\. Silhouette\n\nCan you recognize the character from their shadow alone? A unique silhouette (created by clothing, hair, weapons, or posture) is the cornerstone of memorable design.\n\n  - *Think of:* Master Chief's helmet, Lara Croft's dual pistols, Cloud Strife's spiky hair and Buster Sword.\n\n### 2\\. Color Palette\n\nColors evoke emotion and communicate character. What do your character's colors say about them?\n\n  - **Heroes:** Often use bright, primary colors (blue, red, yellow) to signify hope and clarity.\n  - **Anti-Heroes/Villains:** Tend towards darker, more muted palettes (black, gray, deep red) to represent ambiguity or menace.\n  - **Nature-aligned:** Greens, browns, and earthy tones.\n\n### 3\\. Key Visual Elements\n\nWhat are the 1-3 signature items or features that define their look?\n\n  - A distinctive scar or tattoo.\n  - A unique piece of armor or clothing.\n  - A signature weapon or prop.\n  - A specific hairstyle or facial feature.\n\nThese elements should tell a story. Is that armor pristine or battle-worn? Is that scar a mark of shame or pride?"
      },
      "position": {
        "x": 5650,
        "y": 4350
      },
      "title": "The \"Look\""
    },
    {
      "id": 5,
      "data": {
        "content": "# 🛠️ Skills & Gameplay Abilities\n\nThis node links the character's narrative directly to their function in the game. Their abilities should feel like a natural extension of who they are.\n\n*Gameplay is character in action.*\n\n----\n\n### 1\\. Core Gameplay Loop\n\nWhat does the player *do* as this character? Define their primary verbs.\n\n  - **Combat:** Do they use brute force, stealth, ranged attacks, or magic? Are they fast and agile or slow and powerful?\n  - **Exploration:** How do they traverse the world? Can they climb, fly, swing, or teleport?\n  - **Interaction:** Are they a smooth talker who resolves conflict with dialogue, or a tinkerer who solves problems with gadgets?\n\n### 2\\. Signature Abilities\n\nWhat unique skills or powers set them apart? These should be tied to their backstory and personality.\n\n  - *Example:* A character who distrusts technology might rely on nature magic. A former assassin would naturally have stealth abilities.\n\n### 3\\. Strengths and Weaknesses\n\nTo create balance and strategic depth, a character's strengths must be offset by clear weaknesses. This applies to both gameplay and narrative.\n\n  - **Gameplay Weakness:** A heavily armored knight might be slow. A powerful glass-cannon mage might have low health.\n  - **Narrative Weakness:** Their reliance on brute force might make them fail at tasks requiring diplomacy."
      },
      "position": {
        "x": 4350,
        "y": 4350
      },
      "title": "The \"How\""
    },
    {
      "id": 6,
      "data": {
        "content": "# 📈 Character Arc & Development\n\nA character arc is the journey of transformation a character undergoes. This is the emotional core of the story and what makes a character's journey satisfying for the player.\n\n*The journey is about who they become.*\n\n----\n\n### 1\\. The Starting Point (The Lie)\n\nWhat is the fundamental lie or flawed belief the character holds at the beginning of the story? This is directly tied to their central flaw.\n  - *Example:* \"I am only worthy if I am strong,\" or \"I must be alone to be safe.\"\n\n### 2\\. The Inciting Incident & Midpoint\n\n  - **Inciting Incident:** The event that forces the character to confront their flaw and begin their journey.\n  - **The Midpoint:** A point of no return. The character often has a revelation that their initial approach (their \"Want\") is not working, forcing them to start addressing their \"Need.\"\n\n### 3\\. The Climax & Resolution (The Truth)\n\n  - **The Climax:** The final confrontation where the character must choose between their old flawed belief and the new truth they have learned.\n  - **The Resolution (The Truth):** The character has integrated their new belief. They have changed. They may not have gotten what they *wanted*, but they have achieved what they *needed*. This demonstrates their growth."
      },
      "position": {
        "x": 5000,
        "y": 3200
      },
      "title": "The Journey"
    },
    {
      "id": 7,
      "data": {
        "content": "# 🤝 Relationships & Connections\n\nCharacters do not exist in a vacuum. Their relationships with others serve to challenge their beliefs, reveal their personality, and advance the plot.\n\n*You can tell who a person is by the company they keep.*\n\n----\n\n### 1\\. The Foil\n\nCreate a character who is the opposite of the protagonist in a meaningful way. Their purpose is to highlight the protagonist's traits and challenge their worldview.\n\n  - *Example:* A cautious, by-the-book partner for a reckless, impulsive hero.\n\n### 2\\. The Mentor\n\nThis character provides guidance, training, or a crucial piece of knowledge. A good mentor often has their own flaws or a tragic past that informs their wisdom.\n\n### 3\\. The Antagonist (The Shadow)\n\nA great villain is the hero of their own story and should be as compelling as the protagonist. They often represent the dark reflection of the hero's own flaws or temptations.\n\n  - **Function:** The antagonist's primary role is to apply constant pressure on the hero's central flaw, forcing them to change or break."
      },
      "position": {
        "x": 3700,
        "y": 4000
      },
      "title": "The World"
    },
    {
      "id": 8,
      "data": {
        "content": "# 🎙️ Voice & Dialogue\n\nA character's voice—both their literal sound and their style of speaking—is a powerful tool for expressing personality.\n\n*Dialogue is the music of character.*\n\n----\n\n### 1\\. Manner of Speaking\n\nHow do they talk? This should be consistent with their background and personality.\n\n  - **Vocabulary:** Do they use complex words or simple, direct language?\n  - **Pacing:** Do they speak quickly and excitedly, or slowly and deliberately?\n  - **Tone:** Are they sarcastic, sincere, aggressive, or passive?\n\n### 2\\. Signature Phrases\n\nDoes the character have a recurring catchphrase or a unique way of saying something? This can make their dialogue instantly recognizable and memorable.\n\n### 3\\. The Sound\n\nIf the character will be voice-acted, what is the quality of their voice?\n\n  - High or low pitch?\n  - Raspy or smooth?\n  - What accent do they have?\n\nGood voice acting can elevate a character from words on a page to a living, breathing person."
      },
      "position": {
        "x": 6300,
        "y": 4000
      },
      "title": "The \"Sound\""
    }
  ],
  "connections": [
    {
      "id": "1-6",
      "start": {
        "nodeId": 1
      },
      "end": {
        "nodeId": 6
      }
    },
    {
      "id": "1-2",
      "start": {
        "nodeId": 1
      },
      "end": {
        "nodeId": 2
      }
    },
    {
      "id": "1-3",
      "start": {
        "nodeId": 1
      },
      "end": {
        "nodeId": 3
      }
    },
    {
      "id": "1-4",
      "start": {
        "nodeId": 1
      },
      "end": {
        "nodeId": 4
      }
    },
    {
      "id": "1-5",
      "start": {
        "nodeId": 1
      },
      "end": {
        "nodeId": 5
      }
    },
    {
      "id": "2-7",
      "start": {
        "nodeId": 2
      },
      "end": {
        "nodeId": 7
      }
    },
    {
      "id": "3-8",
      "start": {
        "nodeId": 3
      },
      "end": {
        "nodeId": 8
      }
    },
    {
      "id": "2-5",
      "start": {
        "nodeId": 2
      },
      "end": {
        "nodeId": 5
      }
    },
    {
      "id": "3-4",
      "start": {
        "nodeId": 3
      },
      "end": {
        "nodeId": 4
      }
    },
    {
      "id": "6-3",
      "start": {
        "nodeId": 6
      },
      "end": {
        "nodeId": 3
      }
    }
  ],
  "connectionThemes": {
    "1-6": "lime",
    "1-2": "lime",
    "1-3": "lime",
    "1-4": "lime",
    "1-5": "lime"
  },
  "nodeIdCounter": 9,
  "globalTheme": "blue",
  "nodeThemes": {
    "1": "pink"
  },
  "version": "1.0",
  "exportedAt": "2025-09-30T19:04:20.113Z"
}
